nc: 80
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],
   [-1, 1, Conv, [64, 3, 2]],
   [-1, 1, ResidualBlock, [64]],
   [-1, 1, Conv, [128, 3, 2]],
   [-1, 2, ResidualBlock, [128]],
   [-1, 1, Conv, [256, 3, 2]],
   [-1, 8, ResidualBlock, [256]],
   [-1, 1, Conv, [512, 3, 2]],
   [-1, 8, ResidualBlock, [512]],
   [-1, 1, Conv, [1024, 3, 2]],
   [-1, 4, ResidualBlock, [1024]] # 10
  ]

head:
  [[-1, 1, FeatureBlock, [512]],
   [-1, 1, UpBlock, [256]],
   [[-1, 8], 1, ConcatBlock, [1]], # 13

   [-1, 1, FeatureBlock, [256]],# 14
   [-1, 1, UpBlock, [128]],
   [[-1, 6], 1, ConcatBlock, [1]],# 16

   [ -1, 1, FeatureBlock, [ 128] ],
   [ -1, 1, UpBlock, [ 64 ] ],
   [ [ -1, 4 ], 1, ConcatBlock, [1 ] ],

   [13, 1, HeadBlock, []],
   [16, 1, HeadBlock, []],
   [ 19, 1, HeadBlock, [] ],
  ]
